OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  DBUGF("Starting WiFi scan");
  bool scanStarted = net.wifiScanNetworks([request, response](int networksFound) {
    DBUGF("%d networks found", networksFound);
    response->print("[");
    for (int i = 0; i < networksFound; ++i) {
      if(i) response->print(",");
      StaticJsonDocument<256> network;
      network["rssi"] = WiFi.RSSI(i);
      network["ssid"] = WiFi.SSID(i);
      network["bssid"] = WiFi.BSSIDstr(i);
      network["channel"] = WiFi.channel(i);
      network["secure"] = WiFi.encryptionType(i);
      serializeJson(network, *response);
    }
    response->print("]");
    request->send(response);
  });

  if(!scanStarted) {
    DBUGLN("WiFi scan failed to start");
    response->print("[]");
    request->send(response);
  }
}

// -------------------------------------------------------------------
// Destructive actuators (/reset, /restart, /apoff) must not fire from a bare
// cross-site GET (e.g. <img src="/reset">). Require either a non-GET method or
// the SPA's custom header, which a cross-origin GET cannot set — defense in
// depth beyond SameSite=Strict on the worst-consequence endpoints. Sends 403
// and returns false when the request is a headerless GET; the caller's response
// stream is already open (from requestPreProcess).
// -------------------------------------------------------------------
static bool actuatorMethodAllowed(MongooseHttpServerRequest *request,
                                  MongooseHttpServerResponseStream *response)
{
  if(request->method() != HTTP_GET) {
    return true;
  }
  MongooseString xrw = request->headers("X-Requested-With");
  if(xrw && 0 == strcmp(xrw.c_str(), "OpenEVSE")) {
    return true;
  }
  response->setCode(403);
  response->print("Forbidden: use POST or the app");
  request->send(response);
  return false;
}

// -------------------------------------------------------------------
// Handle turning Access point off
// url: /apoff
// -------------------------------------------------------------------
void
handleAPOff(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  response->setCode(200);
  response->print("Turning AP Off");
  request->send(response);

  DBUGLN("Turning AP Off");
  apOffTime = millis() + 1000;
}

// -------------------------------------------------------------------
// Change divert mode (solar PV divert mode) e.g 1:Normal (default), 2:Eco
// url: /divertmode
// -------------------------------------------------------------------
void
handleDivertMode(MongooseHttpServerRequest *request){
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  DivertMode divertmode = (DivertMode)(request->getParam("divertmode").toInt());
  divert.setMode(divertmode);

  response->setCode(200);
  response->print("Divert Mode changed");
  request->send(response);

  DBUGF("Divert Mode: %d", divertmode);
}

// -------------------------------------------------------------------
// Change current shaper mode 0:disable (default), 1:Enable
// url: /shaper
// -------------------------------------------------------------------
void
handleCurrentShaper(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  shaper.setState(request->getParam("shaper").toInt() == 1? true: false);

  response->setCode(200);
  response->print("Current Shaper state changed");
  request->send(response);

  DBUGF("CurrentShaper: %d", shaper.getState());
}

// -------------------------------------------------------------------
// Manually set the time
// url: /settime
// -------------------------------------------------------------------
void handleSetTime(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  handleTimePost(request, response);

  request->send(response);
}

// -------------------------------------------------------------------
// Get Tesla Vehicle Info
// url: /teslaveh
// -------------------------------------------------------------------
void
handleTeslaVeh(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  StaticJsonDocument<1024> doc;
  int count = teslaClient.getVehicleCnt();
  doc["count"] = count;
  JsonArray vehicles = doc.createNestedArray("vehicles");

  for (int i = 0; i < count; i++)
  {
    JsonObject vehicle = vehicles.createNestedObject();
    vehicle["id"] = teslaClient.getVehicleId(i);
    vehicle["name"] = teslaClient.getVehicleDisplayName(i);
  }

  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void handleStatusPost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();
  // Deserialize the JSON document
  const size_t capacity = JSON_OBJECT_SIZE(32) + 1024;
  DynamicJsonDocument doc(capacity);
  DeserializationError error = deserializeJson(doc, body);
  if(!error)
  {
    bool send_event = true;

    if(doc.containsKey("voltage"))
    {
      double volts = doc["voltage"];
      DBUGF("voltage:%.1f", volts);
      evse.setVoltage(volts);
    }
    if(doc.containsKey("shaper_live_pwr"))
    {
      double shaper_live_pwr = doc["shaper_live_pwr"];
      shaper.setLivePwr(shaper_live_pwr);
      DBUGF("shaper: live power:%dW", shaper.getLivePwr());
    }
    if(doc.containsKey("solar")) {
      divert.setSolar(doc["solar"]);
      DBUGF("solar:%dW", divert.getSolar());
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    else if(doc.containsKey("grid_ie")) {
      divert.setGridIe(doc["grid_ie"]);
      DBUGF("grid:%dW", divert.getGridIe());
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    if(doc.containsKey("battery_level") && vehicle_data_src == VEHICLE_DATA_SRC_HTTP) {
      double vehicle_soc = doc["battery_level"];
      DBUGF("vehicle_soc:%d%%", vehicle_soc);
      evse.setVehicleStateOfCharge(vehicle_soc);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("battery_range") && vehicle_data_src == VEHICLE_DATA_SRC_HTTP) {
      double vehicle_range = doc["battery_range"];
      DBUGF("vehicle_range:%dKM", vehicle_range);
      evse.setVehicleRange(vehicle_range);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("time_to_full_charge") && vehicle_data_src == VEHICLE_DATA_SRC_HTTP){
      double vehicle_eta = doc["time_to_full_charge"];
      DBUGF("vehicle_eta:%d", vehicle_eta);
      evse.setVehicleEta(vehicle_eta);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("vehicle_charge_limit") && vehicle_data_src == VEHICLE_DATA_SRC_HTTP){
      int vehicle_charge_limit = doc["vehicle_charge_limit"];
      DBUGF("vehicle_charge_limit:%d%%", vehicle_charge_limit);
      evse.setVehicleChargeLimit(vehicle_charge_limit);
      doc["vehicle_state_update"] = 0;
    }
    // Display-only home/powerwall battery feeds. Like the solar/grid pushes
    // above these are an explicit override (no data_src arbitration); they just
    // surface in /status and on the display.
    if(doc.containsKey("home_battery_soc")) {
      int soc = doc["home_battery_soc"];
      DBUGF("home_battery_soc:%d%%", soc);
      home_battery_set_soc(soc);
    }
    if(doc.containsKey("home_battery_power")) {
      int power = doc["home_battery_power"];
      DBUGF("home_battery_power:%dW", power);
      home_battery_set_power(power);
    }
    // send back new value to clients
    if(send_event) {
      event_send(doc);
    }
    response->setCode(200);
    serializeJson(doc, *response);
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
  }
}


void
handleStatus(MongooseHttpServerRequest *request)
{

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

